MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKW21D256VHA5/mcu.h
/*! @name TOVALH - Watchdog Time-out Value Register High */
#define WDOG_TOVALH_TOVALHIGH_MASK               (0xFFFFU)
#define WDOG_TOVALH_TOVALHIGH_SHIFT              (0U)
#define WDOG_TOVALH_TOVALHIGH(x)                 (((uint16_t)(((uint16_t)(x)) << WDOG_TOVALH_TOVALHIGH_SHIFT)) & WDOG_TOVALH_TOVALHIGH_MASK)

/*! @name TOVALL - Watchdog Time-out Value Register Low */
#define WDOG_TOVALL_TOVALLOW_MASK                (0xFFFFU)
#define WDOG_TOVALL_TOVALLOW_SHIFT               (0U)
#define WDOG_TOVALL_TOVALLOW(x)                  (((uint16_t)(((uint16_t)(x)) << WDOG_TOVALL_TOVALLOW_SHIFT)) & WDOG_TOVALL_TOVALLOW_MASK)

/*! @name WINH - Watchdog Window Register High */
#define WDOG_WINH_WINHIGH_MASK                   (0xFFFFU)
#define WDOG_WINH_WINHIGH_SHIFT                  (0U)
#define WDOG_WINH_WINHIGH(x)                     (((uint16_t)(((uint16_t)(x)) << WDOG_WINH_WINHIGH_SHIFT)) & WDOG_WINH_WINHIGH_MASK)

/*! @name WINL - Watchdog Window Register Low */
#define WDOG_WINL_WINLOW_MASK                    (0xFFFFU)
#define WDOG_WINL_WINLOW_SHIFT                   (0U)
#define WDOG_WINL_WINLOW(x)                      (((uint16_t)(((uint16_t)(x)) << WDOG_WINL_WINLOW_SHIFT)) & WDOG_WINL_WINLOW_MASK)

/*! @name REFRESH - Watchdog Refresh register */
#define WDOG_REFRESH_WDOGREFRESH_MASK            (0xFFFFU)
#define WDOG_REFRESH_WDOGREFRESH_SHIFT           (0U)
#define WDOG_REFRESH_WDOGREFRESH(x)              (((uint16_t)(((uint16_t)(x)) << WDOG_REFRESH_WDOGREFRESH_SHIFT)) & WDOG_REFRESH_WDOGREFRESH_MASK)

/*! @name UNLOCK - Watchdog Unlock register */
#define WDOG_UNLOCK_WDOGUNLOCK_MASK              (0xFFFFU)
#define WDOG_UNLOCK_WDOGUNLOCK_SHIFT             (0U)
#define WDOG_UNLOCK_WDOGUNLOCK(x)                (((uint16_t)(((uint16_t)(x)) << WDOG_UNLOCK_WDOGUNLOCK_SHIFT)) & WDOG_UNLOCK_WDOGUNLOCK_MASK)

/*! @name TMROUTH - Watchdog Timer Output Register High */
#define WDOG_TMROUTH_TIMEROUTHIGH_MASK           (0xFFFFU)
#define WDOG_TMROUTH_TIMEROUTHIGH_SHIFT          (0U)
#define WDOG_TMROUTH_TIMEROUTHIGH(x)             (((uint16_t)(((uint16_t)(x)) << WDOG_TMROUTH_TIMEROUTHIGH_SHIFT)) & WDOG_TMROUTH_TIMEROUTHIGH_MASK)

/*! @name TMROUTL - Watchdog Timer Output Register Low */
#define WDOG_TMROUTL_TIMEROUTLOW_MASK            (0xFFFFU)
#define WDOG_TMROUTL_TIMEROUTLOW_SHIFT           (0U)
#define WDOG_TMROUTL_TIMEROUTLOW(x)              (((uint16_t)(((uint16_t)(x)) << WDOG_TMROUTL_TIMEROUTLOW_SHIFT)) & WDOG_TMROUTL_TIMEROUTLOW_MASK)

/*! @name RSTCNT - Watchdog Reset Count register */
#define WDOG_RSTCNT_RSTCNT_MASK                  (0xFFFFU)
#define WDOG_RSTCNT_RSTCNT_SHIFT                 (0U)
#define WDOG_RSTCNT_RSTCNT(x)                    (((uint16_t)(((uint16_t)(x)) << WDOG_RSTCNT_RSTCNT_SHIFT)) & WDOG_RSTCNT_RSTCNT_MASK)

/*! @name PRESC - Watchdog Prescaler register */
#define WDOG_PRESC_PRESCVAL_MASK                 (0x700U)
#define WDOG_PRESC_PRESCVAL_SHIFT                (8U)
#define WDOG_PRESC_PRESCVAL(x)                   (((uint16_t)(((uint16_t)(x)) << WDOG_PRESC_PRESCVAL_SHIFT)) & WDOG_PRESC_PRESCVAL_MASK)


/*!
 * @}
 */ /* end of group WDOG_Register_Masks */


/* WDOG - Peripheral instance base addresses */
/** Peripheral WDOG base address */
#define WDOG_BASE                                (0x40052000u)
/** Peripheral WDOG base pointer */
#define WDOG                                     ((WDOG_Type *)WDOG_BASE)
/** Array initializer of WDOG peripheral base addresses */
#define WDOG_BASE_ADDRS                          { WDOG_BASE }
/** Array initializer of WDOG peripheral base pointers */
#define WDOG_BASE_PTRS                           { WDOG }
/** Interrupt vectors for the WDOG peripheral type */
#define WDOG_IRQS                                { WDOG_EWM_IRQn }

/*!
 * @}
 */ /* end of group WDOG_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


/* ----------------------------------------------------------------------------
   -- Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Bit_Field_Generic_Macros Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
 * @{
 */

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang system_header
  #endif
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma system_include
#endif

/**
 * @brief Mask and left-shift a bit field value for use in a register bit range.
 * @param field Name of the register bit field.
 * @param value Value of the bit field.
 * @return Masked and shifted value.
 */
#define NXP_VAL2FLD(field, value)    (((value) << (field ## _SHIFT)) & (field ## _MASK))
/**
 * @brief Mask and right-shift a register value to extract a bit field value.
 * @param field Name of the register bit field.
 * @param value Value of the register.
 * @return Masked and shifted bit field value.
 */
#define NXP_FLD2VAL(field, value)    (((value) & (field ## _MASK)) >> (field ## _SHIFT))

/*!
 * @}
 */ /* end of group Bit_Field_Generic_Macros */


/* ----------------------------------------------------------------------------
   -- SDK Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDK_Compatibility_Symbols SDK Compatibility
 * @{
 */

#define MCG_S_LOLS_MASK                   MCG_S_LOLS0_MASK
#define MCG_S_LOLS_SHIFT                  MCG_S_LOLS0_SHIFT
#define DAC0_IRQn                         This_symbol_has_been_deprecated
#define DAC_DATL_REG(base,index)          This_symbol_has_been_deprecated
#define DAC_DATH_REG(base,index)          This_symbol_has_been_deprecated
#define DAC_SR_REG(base)                  This_symbol_has_been_deprecated
#define DAC_C0_REG(base)                  This_symbol_has_been_deprecated
#define DAC_C1_REG(base)                  This_symbol_has_been_deprecated
#define DAC_C2_REG(base)                  This_symbol_has_been_deprecated
#define DAC_DATL_DATA0_MASK               This_symbol_has_been_deprecated
#define DAC_DATL_DATA0_SHIFT              This_symbol_has_been_deprecated
#define DAC_DATL_DATA0(x)                 This_symbol_has_been_deprecated
#define DAC_DATH_DATA1_MASK               This_symbol_has_been_deprecated
#define DAC_DATH_DATA1_SHIFT              This_symbol_has_been_deprecated
#define DAC_DATH_DATA1(x)                 This_symbol_has_been_deprecated
#define DAC_SR_DACBFRPBF_MASK             This_symbol_has_been_deprecated
#define DAC_SR_DACBFRPBF_SHIFT            This_symbol_has_been_deprecated
#define DAC_SR_DACBFRPTF_MASK             This_symbol_has_been_deprecated
#define DAC_SR_DACBFRPTF_SHIFT            This_symbol_has_been_deprecated
#define DAC_SR_DACBFWMF_MASK              This_symbol_has_been_deprecated
#define DAC_SR_DACBFWMF_SHIFT             This_symbol_has_been_deprecated
#define DAC_C0_DACBBIEN_MASK              This_symbol_has_been_deprecated
#define DAC_C0_DACBBIEN_SHIFT             This_symbol_has_been_deprecated
#define DAC_C0_DACBTIEN_MASK              This_symbol_has_been_deprecated
#define DAC_C0_DACBTIEN_SHIFT             This_symbol_has_been_deprecated
#define DAC_C0_DACBWIEN_MASK              This_symbol_has_been_deprecated
#define DAC_C0_DACBWIEN_SHIFT             This_symbol_has_been_deprecated
#define DAC_C0_LPEN_MASK                  This_symbol_has_been_deprecated
#define DAC_C0_LPEN_SHIFT                 This_symbol_has_been_deprecated
#define DAC_C0_DACSWTRG_MASK              This_symbol_has_been_deprecated
#define DAC_C0_DACSWTRG_SHIFT             This_symbol_has_been_deprecated
#define DAC_C0_DACTRGSEL_MASK             This_symbol_has_been_deprecated
#define DAC_C0_DACTRGSEL_SHIFT            This_symbol_has_been_deprecated
#define DAC_C0_DACRFS_MASK                This_symbol_has_been_deprecated
#define DAC_C0_DACRFS_SHIFT               This_symbol_has_been_deprecated
#define DAC_C0_DACEN_MASK                 This_symbol_has_been_deprecated
#define DAC_C0_DACEN_SHIFT                This_symbol_has_been_deprecated
#define DAC_C1_DACBFEN_MASK               This_symbol_has_been_deprecated
#define DAC_C1_DACBFEN_SHIFT              This_symbol_has_been_deprecated
#define DAC_C1_DACBFMD_MASK               This_symbol_has_been_deprecated
#define DAC_C1_DACBFMD_SHIFT              This_symbol_has_been_deprecated
#define DAC_C1_DACBFMD(x)                 This_symbol_has_been_deprecated
#define DAC_C1_DACBFWM_MASK               This_symbol_has_been_deprecated
#define DAC_C1_DACBFWM_SHIFT              This_symbol_has_been_deprecated
#define DAC_C1_DACBFWM(x)                 This_symbol_has_been_deprecated
#define DAC_C1_DMAEN_MASK                 This_symbol_has_been_deprecated
#define DAC_C1_DMAEN_SHIFT                This_symbol_has_been_deprecated
#define DAC_C2_DACBFUP_MASK               This_symbol_has_been_deprecated
#define DAC_C2_DACBFUP_SHIFT              This_symbol_has_been_deprecated
#define DAC_C2_DACBFUP(x)                 This_symbol_has_been_deprecated
#define DAC_C2_DACBFRP_MASK               This_symbol_has_been_deprecated
#define DAC_C2_DACBFRP_SHIFT              This_symbol_has_been_deprecated
#define DAC_C2_DACBFRP(x)                 This_symbol_has_been_deprecated
#define DAC0_BASE                         This_symbol_has_been_deprecated
#define DAC0                              This_symbol_has_been_deprecated
#define DAC_BASE_ADDRS                    This_symbol_has_been_deprecated
#define DAC_IRQS                          This_symbol_has_been_deprecated
#define DAC0_DAT0L                        This_symbol_has_been_deprecated
#define DAC0_DAT0H                        This_symbol_has_been_deprecated
#define DAC0_DAT1L                        This_symbol_has_been_deprecated
#define DAC0_DAT1H                        This_symbol_has_been_deprecated
#define DAC0_DAT2L                        This_symbol_has_been_deprecated
#define DAC0_DAT2H                        This_symbol_has_been_deprecated
#define DAC0_DAT3L                        This_symbol_has_been_deprecated
#define DAC0_DAT3H                        This_symbol_has_been_deprecated
#define DAC0_DAT4L                        This_symbol_has_been_deprecated
#define DAC0_DAT4H                        This_symbol_has_been_deprecated
#define DAC0_DAT5L                        This_symbol_has_been_deprecated
#define DAC0_DAT5H                        This_symbol_has_been_deprecated
#define DAC0_DAT6L                        This_symbol_has_been_deprecated
#define DAC0_DAT6H                        This_symbol_has_been_deprecated
#define DAC0_DAT7L                        This_symbol_has_been_deprecated
#define DAC0_DAT7H                        This_symbol_has_been_deprecated
#define DAC0_DAT8L                        This_symbol_has_been_deprecated
#define DAC0_DAT8H                        This_symbol_has_been_deprecated
#define DAC0_DAT9L                        This_symbol_has_been_deprecated
#define DAC0_DAT9H                        This_symbol_has_been_deprecated
#define DAC0_DAT10L                       This_symbol_has_been_deprecated
#define DAC0_DAT10H                       This_symbol_has_been_deprecated
#define DAC0_DAT11L                       This_symbol_has_been_deprecated
#define DAC0_DAT11H                       This_symbol_has_been_deprecated
#define DAC0_DAT12L                       This_symbol_has_been_deprecated
#define DAC0_DAT12H                       This_symbol_has_been_deprecated
#define DAC0_DAT13L                       This_symbol_has_been_deprecated
#define DAC0_DAT13H                       This_symbol_has_been_deprecated
#define DAC0_DAT14L                       This_symbol_has_been_deprecated
#define DAC0_DAT14H                       This_symbol_has_been_deprecated
#define DAC0_DAT15L                       This_symbol_has_been_deprecated
#define DAC0_DAT15H                       This_symbol_has_been_deprecated
#define DAC0_SR                           This_symbol_has_been_deprecated
#define DAC0_C0                           This_symbol_has_been_deprecated
#define DAC0_C1                           This_symbol_has_been_deprecated
#define DAC0_C2                           This_symbol_has_been_deprecated
#define DAC0_DATL(index)                  This_symbol_has_been_deprecated
#define DAC0_DATH(index)                  This_symbol_has_been_deprecated
#define DMA_EARS_REG(base)                This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_0_MASK             This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_0_SHIFT            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_1_MASK             This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_1_SHIFT            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_2_MASK             This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_2_SHIFT            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_3_MASK             This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_3_SHIFT            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_4_MASK             This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_4_SHIFT            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_5_MASK             This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_5_SHIFT            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_6_MASK             This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_6_SHIFT            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_7_MASK             This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_7_SHIFT            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_8_MASK             This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_8_SHIFT            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_9_MASK             This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_9_SHIFT            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_10_MASK            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_10_SHIFT           This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_11_MASK            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_11_SHIFT           This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_12_MASK            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_12_SHIFT           This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_13_MASK            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_13_SHIFT           This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_14_MASK            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_14_SHIFT           This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_15_MASK            This_symbol_has_been_deprecated
#define DMA_EARS_EDREQ_15_SHIFT           This_symbol_has_been_deprecated
#define DMA_EARS                          This_symbol_has_been_deprecated
#define DSPI0                             SPI0
#define DSPI1                             SPI1
#define DMAMUX0                           DMAMUX
#define WP7816_T_TYPE0                    WP7816T0
#define WP7816_T_TYPE1                    WP7816T1
#define UART_WP7816_T_TYPE0_REG(base)     UART_WP7816T0_REG(base)
#define UART_WP7816_T_TYPE1_REG(base)     UART_WP7816T1_REG(base)
#define UART_WP7816_T_TYPE0_WI_MASK       UART_WP7816T0_WI_MASK
#define UART_WP7816_T_TYPE0_WI_SHIFT      UART_WP7816T0_WI_SHIFT
#define UART_WP7816_T_TYPE0_WI(X)         UART_WP7816T0_WI(X)
#define UART_WP7816_T_TYPE1_BWI_MASK      UART_WP7816T1_BWI_MASK
#define UART_WP7816_T_TYPE1_BWI_SHIFT     UART_WP7816T1_BWI_SHIFT
#define UART_WP7816_T_TYPE1_BWI(X)        UART_WP7816T1_BWI(X)
#define UART_WP7816_T_TYPE1_CWI_MASK      UART_WP7816T1_CWI_MASK
#define UART_WP7816_T_TYPE1_CWI_SHIFT     UART_WP7816T1_CWI_SHIFT
#define UART_WP7816_T_TYPE1_CWI(X)        UART_WP7816T1_CWI(X)
#define SIM_SOPT1_USBVSTBY_MASK           This_symbol_has_been_deprecated
#define SIM_SOPT1_USBVSTBY_SHIFT          This_symbol_has_been_deprecated
#define SIM_SOPT1_USBSSTBY_MASK           This_symbol_has_been_deprecated
#define SIM_SOPT1_USBSSTBY_SHIFT          This_symbol_has_been_deprecated
#define SIM_SOPT1_USBREGEN_MASK           This_symbol_has_been_deprecated
#define SIM_SOPT1_USBREGEN_SHIFT          This_symbol_has_been_deprecated
#define SIM_SOPT1CFG_URWE_MASK            This_symbol_has_been_deprecated
#define SIM_SOPT1CFG_URWE_SHIFT           This_symbol_has_been_deprecated
#define SIM_SOPT1CFG_UVSWE_MASK           This_symbol_has_been_deprecated
#define SIM_SOPT1CFG_UVSWE_SHIFT          This_symbol_has_been_deprecated
#define SIM_SOPT1CFG_USSWE_MASK           This_symbol_has_been_deprecated
#define SIM_SOPT1CFG_USSWE_SHIFT          This_symbol_has_been_deprecated
#define SIM_SOPT2_USBSRC_MASK             This_symbol_has_been_deprecated
#define SIM_SOPT2_USBSRC_SHIFT            This_symbol_has_been_deprecated
#define SIM_SCGC4_USBOTG_MASK             This_symbol_has_been_deprecated
#define SIM_SCGC4_USBOTG_SHIFT            This_symbol_has_been_deprecated
#define SIM_SCGC6_USBDCD_MASK             This_symbol_has_been_deprecated
#define SIM_SCGC6_USBDCD_SHIFT            This_symbol_has_been_deprecated
#define SIM_CLKDIV2_USBFRAC_MASK          This_symbol_has_been_deprecated
#define SIM_CLKDIV2_USBFRAC_SHIFT         This_symbol_has_been_deprecated
#define SIM_CLKDIV2_USBDIV_MASK           This_symbol_has_been_deprecated
#define SIM_CLKDIV2_USBDIV_SHIFT          This_symbol_has_been_deprecated
#define SIM_CLKDIV2_USBDIV(x)             This_symbol_has_been_deprecated
#define SIM_SCGC6_DAC0_MASK               This_symbol_has_been_deprecated
#define SIM_SCGC6_DAC0_SHIFT              This_symbol_has_been_deprecated
#define Watchdog_IRQn                     WDOG_EWM_IRQn
#define Watchdog_IRQHandler               WDOG_EWM_IRQHandler
#define LPTimer_IRQn                      LPTMR0_IRQn
#define LPTimer_IRQHandler                LPTMR0_IRQHandler
#define LLW_IRQn                          LLWU_IRQn
#define LLW_IRQHandler                    LLWU_IRQHandler

/*!
 * @}
 */ /* end of group SDK_Compatibility_Symbols */


#endif  /* _MKW21D5_H_ */

